<template>
  <header class="header">
    <div class="header-top">
      <div class="container">
        <div class="header-top-content">
          <router-link to="/" class="logo">
            <img src="../assets/img/logo.svg" alt=""
          /></router-link>

          <div class="header-top-content-lang">
            <p>
              <img src="../assets/img/eye.svg" alt="" />
              <span>Специальные возможности</span>
            </p>
            <router-link to="#">
              <img src="../assets/img/ru-lang.svg" alt="" />
              <span>Русский</span>
            </router-link>
          </div>

          <div class="header-top-content-socials">
            <a href="https://www.facebook.com/">
              <svg
                width="22"
                height="23"
                viewBox="0 0 22 23"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M21.7549 11.2373C21.7549 5.25471 16.86 0.359863 10.8774 0.359863C4.89484 0.359863 0 5.25471 0 11.2373C0 16.676 3.94307 21.1629 9.10985 21.9788V14.3646H6.39049V11.2373H9.10985V8.78987C9.10985 6.07051 10.7415 4.57487 13.1889 4.57487C14.4126 4.57487 15.6363 4.8468 15.6363 4.8468V7.56616H14.2766C12.9169 7.56616 12.509 8.38197 12.509 9.19778V11.2373H15.5003L14.9565 14.3646H12.3731V22.1147C17.8118 21.2989 21.7549 16.676 21.7549 11.2373Z"
                  fill="#58585A"
                />
              </svg>
            </a>
            <a href="telegram.org">
              <svg
                width="22"
                height="19"
                viewBox="0 0 22 19"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M1.54876 7.8408C7.38852 5.2965 11.2826 3.61915 13.231 2.80873C18.7942 0.494837 19.9501 0.0928885 20.7036 0.0794744C20.8693 0.0766967 21.2398 0.117765 21.4798 0.312516C21.6825 0.476959 21.7382 0.6991 21.7649 0.85501C21.7916 1.01092 21.8248 1.36609 21.7984 1.64361C21.4969 4.81116 20.1925 12.498 19.5289 16.0457C19.2481 17.5468 18.6951 18.0502 18.1599 18.0994C16.9966 18.2065 16.1132 17.3306 14.9865 16.5921C13.2234 15.4363 12.2274 14.7169 10.516 13.5891C8.53819 12.2858 9.82032 11.5694 10.9475 10.3988C11.2424 10.0924 16.368 5.43031 16.4672 5.00739C16.4796 4.95449 16.4911 4.75733 16.374 4.65322C16.2568 4.54911 16.084 4.58471 15.9592 4.61303C15.7824 4.65316 12.9658 6.5148 7.50955 10.1979C6.71008 10.7469 5.98595 11.0144 5.33715 11.0004C4.6219 10.9849 3.24605 10.596 2.22324 10.2635C0.968732 9.8557 -0.0283286 9.6401 0.058493 8.94754C0.103715 8.58681 0.600469 8.2179 1.54876 7.8408Z"
                  fill="#58585A"
                />
              </svg>
            </a>
            <a href="instagram.com">
              <svg
                width="23"
                height="23"
                viewBox="0 0 23 23"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M11.5685 2.03952C14.5598 2.03952 14.9677 2.03952 16.1914 2.03952C17.2792 2.03952 17.8231 2.31145 18.231 2.44742C18.7748 2.71936 19.1827 2.85533 19.5906 3.26323C19.9985 3.67113 20.2705 4.07904 20.4065 4.62291C20.5424 5.03081 20.6784 5.57468 20.8144 6.66243C20.8144 7.88614 20.8144 8.15807 20.8144 11.2853C20.8144 14.4126 20.8144 14.6845 20.8144 15.9082C20.8144 16.996 20.5424 17.5399 20.4065 17.9478C20.1345 18.4916 19.9985 18.8995 19.5906 19.3074C19.1827 19.7153 18.7748 19.9873 18.231 20.1232C17.8231 20.2592 17.2792 20.3952 16.1914 20.5312C14.9677 20.5312 14.6958 20.5312 11.5685 20.5312C8.44128 20.5312 8.16934 20.5312 6.94563 20.5312C5.85789 20.5312 5.31402 20.2592 4.90611 20.1232C4.36224 19.8513 3.95434 19.7153 3.54643 19.3074C3.13853 18.8995 2.86659 18.4916 2.73063 17.9478C2.59466 17.5399 2.45869 16.996 2.32272 15.9082C2.32272 14.6845 2.32272 14.4126 2.32272 11.2853C2.32272 8.15807 2.32272 7.88614 2.32272 6.66243C2.32272 5.57468 2.59466 5.03081 2.73063 4.62291C3.00256 4.07904 3.13853 3.67113 3.54643 3.26323C3.95434 2.85533 4.36224 2.58339 4.90611 2.44742C5.31402 2.31145 5.85789 2.17549 6.94563 2.03952C8.16934 2.03952 8.57725 2.03952 11.5685 2.03952ZM11.5685 0C8.44128 0 8.16934 0 6.94563 0C5.72192 0 4.90611 0.271937 4.22627 0.543872C3.54643 0.815808 2.86659 1.22371 2.18675 1.90355C1.50691 2.58339 1.23498 3.12726 0.827075 3.94307C0.55514 4.62291 0.419171 5.43872 0.283203 6.66243C0.283203 7.88614 0.283203 8.29404 0.283203 11.2853C0.283203 14.4126 0.283203 14.6845 0.283203 15.9082C0.283203 17.132 0.55514 17.9478 0.827075 18.6276C1.09901 19.3074 1.50691 19.9873 2.18675 20.6671C2.86659 21.347 3.41047 21.6189 4.22627 22.0268C4.90611 22.2987 5.72192 22.4347 6.94563 22.5707C8.16934 22.5707 8.57725 22.5707 11.5685 22.5707C14.5598 22.5707 14.9677 22.5707 16.1914 22.5707C17.4152 22.5707 18.231 22.2987 18.9108 22.0268C19.5906 21.7549 20.2705 21.347 20.9503 20.6671C21.6302 19.9873 21.9021 19.4434 22.31 18.6276C22.5819 17.9478 22.7179 17.132 22.8539 15.9082C22.8539 14.6845 22.8539 14.2766 22.8539 11.2853C22.8539 8.29404 22.8539 7.88614 22.8539 6.66243C22.8539 5.43872 22.5819 4.62291 22.31 3.94307C22.0381 3.26323 21.6302 2.58339 20.9503 1.90355C20.2705 1.22371 19.7266 0.951776 18.9108 0.543872C18.231 0.271937 17.4152 0.135968 16.1914 0C14.9677 0 14.6958 0 11.5685 0Z"
                  fill="#58585A"
                />
                <path
                  d="M11.5685 5.43872C8.30531 5.43872 5.72192 8.02211 5.72192 11.2853C5.72192 14.5486 8.30531 17.132 11.5685 17.132C14.8318 17.132 17.4152 14.5486 17.4152 11.2853C17.4152 8.02211 14.8318 5.43872 11.5685 5.43872ZM11.5685 15.0924C9.52902 15.0924 7.76144 13.4608 7.76144 11.2853C7.76144 9.24582 9.39305 7.47823 11.5685 7.47823C13.6081 7.47823 15.3756 9.10985 15.3756 11.2853C15.3756 13.3249 13.6081 15.0924 11.5685 15.0924Z"
                  fill="#58585A"
                />
                <path
                  d="M17.5511 6.66243C18.3021 6.66243 18.9108 6.05368 18.9108 5.30275C18.9108 4.55182 18.3021 3.94307 17.5511 3.94307C16.8002 3.94307 16.1914 4.55182 16.1914 5.30275C16.1914 6.05368 16.8002 6.66243 17.5511 6.66243Z"
                  fill="#58585A"
                />
              </svg>
            </a>
          </div>

          <div class="header-top-content-phone">
            <a href="tel:+998712305531">
              <img src="../assets/img/phone-icon.svg" alt="" />
              <p>
                <span>+998 71 230 55 31</span>
                <span>Информационный центр</span>
              </p>
            </a>
          </div>
        </div>
      </div>
    </div>
    <nav class="header-nav">
      <div class="container">
        <ul class="header-nav-content">
          <li><router-link to="/">Главная</router-link></li>
          <li><router-link to="/">О нас</router-link></li>
          <li><router-link to="/">Услуги и продукты</router-link></li>
          <li><router-link to="/">Филиалы</router-link></li>
          <li><router-link to="/">Вакансии</router-link></li>
          <li><router-link to="/">Вопрос/Ответ</router-link></li>
          <li><router-link to="/">Контакты</router-link></li>
          <li><router-link class="soon" to="/">Apply online</router-link></li>
          <li><router-link class="soon" to="/">Pay online</router-link></li>
        </ul>
      </div>
    </nav>
  </header>
</template>
<script>
export default {};
</script>
<style lang="scss">
.soon {
  position: relative;
  color: #818181;
  &::before {
    content: "Скоро";
    position: absolute;
    right: -48px;
    top: -12px;
    background: #ff6d39;
    border-radius: 13px;
    font-size: 11px;
    line-height: 13px;
    color: #ffffff;
    padding: 2px 9px;
  }
  &::after{
    display: none;
  }
}
.header {
  &-top {
    background: #ffffff;
    box-shadow: 0px 0px 20px rgba(0, 0, 0, 0.6);
    &-content {
      display: flex;
      justify-content: space-between;
      align-items: center;
      height: 80px;
      &-lang {
        display: flex;
        align-items: center;
        gap: 25px;
        p,
        a {
          display: flex;
          align-items: center;
          gap: 10px;
          cursor: pointer;
        }
      }
      &-socials {
        display: flex;
        align-items: center;
        gap: 29px;
        a {
          svg {
            path {
              transition: 0.3s;
            }
          }
          &:hover {
            svg {
              path {
                fill: #ff6d39;
              }
            }
          }
        }
      }
      &-phone {
        a {
          display: flex;
          align-items: center;
          gap: 10px;
          p {
            display: flex;
            flex-direction: column;
            align-items: center;
            span {
              &:first-child {
                font-weight: 700;
                font-size: 20px;
                line-height: 24px;
                color: #58585a;
              }
              &:last-child {
                font-weight: 400;
                font-size: 14px;
                line-height: 17px;
                letter-spacing: 0.035em;

                color: #afb3bc;
              }
            }
          }
        }
      }
    }
  }
  &-nav {
    margin-top: 29px;
    &-content {
      display: flex;
      justify-content: space-between;
      li {
        a {
          transition: 0.2s linear;
          position: relative;
          color: #fff;
          &::after {
            position: absolute;
            content: "";
            width: 100%;
            height: 1px;
            transition: 0.2s linear;
            transform: scale(0);
            background: #ff6d39;
            bottom: -4px;
            left: 0;
          }
          &:hover {
            color: #ff6d39;
            &::after {
              transform: scale(1);
            }
          }
        }
      }
    }
  }
}
</style>